# IsEqual Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayVectorSettings..::..IsEqual Method
AnalysisDisplayVectorSettings Class See Also
---
Compares two vector settings objects.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsEqual(
	AnalysisDisplayVectorSettings other
)
```

Visual Basic
---
```text
Public Function IsEqual ( _
	other As AnalysisDisplayVectorSettings _
) As Boolean
```

Visual C++
---
```text
public:
bool IsEqual(
	AnalysisDisplayVectorSettings^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.Analysis..::..AnalysisDisplayVectorSettings Vector settings object to compare with.
# ### Return Value
True if objects are equal, false otherwise.
# See Also
AnalysisDisplayVectorSettings Class
Autodesk.Revit.DB.Analysis Namespace